// 2. Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).

Console.WriteLine("Введите целое число: ");

int number_one = Convert.ToInt32(Console.ReadLine());

number_one = number_one * number_one;

Console.WriteLine(number_one);
